In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
csv_in = '2024-cs3-mid-2-1.csv'
csv_in2 = '2024-cs3-mid-2-2.csv'

In [3]:
df1 = pd.read_csv(csv_in, sep=",", header=0)
display(df1.head())
df2 = pd.read_csv(csv_in2, sep=",", header=0)
display(df2.head())

   ID        c1        c2        c3 q1
0   0 -0.787345  3.754889  0.876407  c
1   1 -0.119684  3.620732  1.944058  b
2   2 -0.656145  4.336709  1.352879  c
3   3 -2.012349  5.430930  0.506446  c
4   4  1.283513  5.497184  3.872931  d

   IDX q2
0    0  t
1    1  t
2    2  s
3    3  r
4    4  r

In [4]:
display(df1[df1.duplicated(keep=False)])
df1m = df1.drop_duplicates().reset_index(drop=True)
print(df1m.shape)

    ID        c1        c2        c3 q1
7    7  1.050161  2.207037  2.180943  c
36   7  1.050161  2.207037  2.180943  c
43   7  1.050161  2.207037  2.180943  c

(48, 5)

In [5]:
print(df1m.isna().sum())
# columns with missing values: c2, c3
display(df1m[df1m.isna().any(axis=1)])
df1m2 = df1m.dropna().reset_index(drop=True)

ID    0
c1    0
c2    3
c3    1
q1    0
dtype: int64

    ID        c1  c2        c3 q1
10  10  0.546855 NaN  3.409160  c
31  31  1.388495 NaN       NaN  c
43  45  0.436719 NaN  1.853421  b

In [6]:
print(df2["q2"].value_counts())

q2
t    18
s    16
r    16
Name: count, dtype: int64

In [7]:
df3 = pd.merge(df1m2, df2, how="inner", left_on="ID",right_on="IDX")
display(df3.head())

   ID        c1        c2        c3 q1  IDX q2
0   0 -0.787345  3.754889  0.876407  c    0  t
1   1 -0.119684  3.620732  1.944058  b    1  t
2   2 -0.656145  4.336709  1.352879  c    2  s
3   3 -2.012349  5.430930  0.506446  c    3  r
4   4  1.283513  5.497184  3.872931  d    4  r

In [8]:
df3_ret = df3[(df3["q2"]=="s")&(df3["c1"]>=2.0)]
df3.to_csv("2024-cs3-mid-out.csv", index=False)
print(df3.shape)

(45, 7)